yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
/**************************************************************************//**
 * @file     main.cpp
 * @version  V1.00
 * @brief    face landmark network sample. Demonstrate face landmark detect.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2024 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

#include "BoardInit.hpp"      /* Board initialisation */
#include "log_macros.h"      /* Logging macros (optional) */

#include "BufAttributes.hpp" /* Buffer attributes to be applied */
#include "FaceLandmarkModel.hpp"       /* Model API */
#include "FaceDetectionModel.hpp"       /* Model API */
#include "FaceLandmarkPostProcessing.hpp"
#include "FaceDetectorPostProcessing.hpp"

#include "imlib.h"          /* Image processing */
#include "framebuffer.h"
#include <cmath>
#include "ModelFileReader.h"
#include "ff.h"

#undef PI /* PI macro conflict with CMSIS/DSP */
#include "NuMicro.h"

//#define __PROFILE__
#define __USE_DISPLAY__
//#define __USE_UVC__

#if defined (FACE_LANDMARK_ATTENTION_MODEL)
#define __LOAD_MODEL_FROM_SD__
#endif

#include "Profiler.hpp"

#include "ImageSensor.h"

#if defined (__USE_DISPLAY__)
    #include "Display.h"
#endif

#if defined (__USE_UVC__)
    #include "UVC.h"
#endif

#define NUM_FRAMEBUF 2  //1 or 2
#define MODEL_AT_HYPERRAM_ADDR (0x82400000)
#define FACE_PRESENCE_THRESHOLD  				(0.4)

/* Speaking detection - lip-relative: MAR + MAR velocity */
#define SPEAKING_MAR_VELOCITY_THRESHOLD_ON	(0.025f) /* Smoothed MAR change - mouth opening/closing */
#define SPEAKING_MAR_VELOCITY_THRESHOLD_OFF	(0.010f) /* Dead zone - lower to release */
#define SPEAKING_MAR_THRESHOLD_ON			(0.20f)  /* Mouth open to trigger (raised for stability) */
#define SPEAKING_MAR_THRESHOLD_OFF			(0.12f)  /* Mouth closed to release */
#define SPEAKING_SMOOTHING_FRAMES			(4)      /* Consecutive updates above threshold to trigger */
#define SPEAKING_RELEASE_FRAMES				(8)      /* Consecutive below to release */
#define SPEAKING_MIN_DURATION_FRAMES		(12)     /* Min frames speaking before can release */
#define SPEAKING_DETECT_EVERY_N_FRAMES		(2)      /* Run detection every N frames */
#define MAR_SMOOTHING_ALPHA				(0.22f)  /* Heavy smoothing - reduces head-movement jitter */
#define BBOX_SMOOTHING_ALPHA				(0.25f)  /* Face bbox EMA - reduces crop jitter */
#define HEAD_MOVE_THRESHOLD				(0.06f)  /* If bbox center moved > 6% of size, ignore motion */

/* Landmark smoothing */
#define LANDMARK_SMOOTHING_ALPHA			(0.28f)  /* Lower = more smoothing */

/* Lip offset: landmarks too high = shift down. Tune per camera/model. */
#define LIP_OFFSET_X  (4)   /* Pixels to shift right */
#define LIP_OFFSET_Y  (3)   /* Positive = shift down (corrects "too high") */

/* Lip indices: lip contour only. Chin excluded - moves a lot with head rotation causing false triggers. */
#define LIP_LANDMARK_NUM		(24)
#define MAR_EXTRA_INDICES_NUM	(0)    /* Chin excluded - use lip-only MAR for head-movement stability */
static const int s_i32LipLandmarkIndices[LIP_LANDMARK_NUM] = {
	61, 146, 91, 181, 84, 17, 314, 405, 321, 375, 291, 185, 40, 39, 37, 0, 267, 269, 270, 409,
	78, 308, 87, 14
};
#if MAR_EXTRA_INDICES_NUM > 0
static const int s_i32MarExtraIndices[MAR_EXTRA_INDICES_NUM] = { 152 };  /* Chin - jaw movement */
#endif

typedef enum
{
    eFRAMEBUF_EMPTY,
    eFRAMEBUF_FULL,
    eFRAMEBUF_INF
} E_FRAMEBUF_STATE;

typedef struct
{
    E_FRAMEBUF_STATE eState;
    image_t frameImage;
    std::vector<arm::app::face_landmark::KeypointResult> results_KP;
    std::vector<arm::app::face_detection::DetectionResult> results_FD;
    std::vector<bool> isSpeaking;   /* Per-face speaking state */
} S_FRAMEBUF;

/* Previous lip positions - stores SMOOTHED RELATIVE coords (0-1 within face bbox) for velocity + EMA */
#define MAX_TRACKED_FACES  5
typedef struct {
    float lipX[LIP_LANDMARK_NUM];  /* Relative: for EMA smoothing */
    float lipY[LIP_LANDMARK_NUM];
    float prevMAR;                 /* Smoothed MAR from previous detection cycle */
    float prevPrevMAR;             /* MAR from 2 cycles ago - for velocity over longer window */
    int prevPrevMARValid;          /* Have we seen 2+ cycles? */
    int x0, y0, w, h;              /* Raw bbox for matching */
    int smoothX0, smoothY0, smoothW, smoothH;  /* EMA-smoothed bbox for crop */
    int valid;
} S_PREV_LIP_STATE;
static S_PREV_LIP_STATE s_asPrevLipState[MAX_TRACKED_FACES];
static int s_i32SpeakingConfirmCount[MAX_TRACKED_FACES];
static int s_i32SpeakingReleaseCount[MAX_TRACKED_FACES];
static int s_i32SpeakingDurationCount[MAX_TRACKED_FACES];
static bool s_abSpeaking[MAX_TRACKED_FACES];  /* Per-track speaking state (trackId-indexed) */

static float s_afSmoothedRelX[LIP_LANDMARK_NUM];  /* Relative coords 0-1 within face bbox */
static float s_afSmoothedRelY[LIP_LANDMARK_NUM];
static uint32_t s_u32SpeakingDetectFrameCount = 0;  /* Skip frames: only run detection every N frames */

S_FRAMEBUF s_asFramebuf[NUM_FRAMEBUF];

namespace arm
{
namespace app
{
/* Tensor arena buffer */
#undef ACTIVATION_BUF_SZ
#if defined(FACE_LANDMARK_ATTENTION_MODEL)
#define FACE_LANDMARK_ACTIVATION_BUF_SZ	 (500000)
#else
#define FACE_LANDMARK_ACTIVATION_BUF_SZ	 (460000)
#endif
#define FACE_DETECTION_ACTIVATION_BUF_SZ (460000)
static uint8_t tensorArena_FaceLandmark[FACE_LANDMARK_ACTIVATION_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;
static uint8_t tensorArena_FaceDetection[FACE_DETECTION_ACTIVATION_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;

#if !defined(__LOAD_MODEL_FROM_SD__)
/* Optional getter function for the model pointer and its size. */
namespace face_landmark
{
extern uint8_t *GetModelPointer();
extern size_t GetModelLen();
} /* namespace face_landmark */

namespace face_detection
{
extern uint8_t *GetModelPointer();
extern size_t GetModelLen();
} /* namespace face_detection */

#endif

} /* namespace app */
} /* namespace arm */

//frame buffer managemnet function
static S_FRAMEBUF *get_empty_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_EMPTY)
            return &s_asFramebuf[i];
    }

