yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
		/* Always: smoothing + drawing. Detection + store only every N frames. */
		if (trackId < MAX_TRACKED_FACES && infFramebuf->results_KP.size() >= 468) {
			ApplyLipSmoothing(infFramebuf->results_KP, trackId, roi.w, roi.h, s_afSmoothedRelX, s_afSmoothedRelY);

			if (runDetectionThisFrame) {
				/* Lip-relative: smoothed MAR + MAR velocity. */
				float rawMAR = ComputeMAR(infFramebuf->results_KP, s_afSmoothedRelX, s_afSmoothedRelY, roi.w, roi.h);
				float smoothedMAR;
				float marVelocity = ComputeMARVelocityAndSmooth(rawMAR, trackId, &smoothedMAR) / (float)SPEAKING_DETECT_EVERY_N_FRAMES;

				/* Head-motion rejection: if bbox moved too much, ignore mouth motion for this update */
				float headMove = HeadMoveAmount(trackId, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
				int headMoving = (headMove > HEAD_MOVE_THRESHOLD);

				int signalAboveOn  = !headMoving && (marVelocity > SPEAKING_MAR_VELOCITY_THRESHOLD_ON) && (smoothedMAR > SPEAKING_MAR_THRESHOLD_ON);
				int signalBelowOff = (marVelocity < SPEAKING_MAR_VELOCITY_THRESHOLD_OFF) || (smoothedMAR < SPEAKING_MAR_THRESHOLD_OFF);

				/* All state indexed by trackId - fixes flicker when face order changes */
				if (signalAboveOn) {
					s_i32SpeakingConfirmCount[trackId] = (s_i32SpeakingConfirmCount[trackId] < SPEAKING_SMOOTHING_FRAMES) ? s_i32SpeakingConfirmCount[trackId] + 1 : SPEAKING_SMOOTHING_FRAMES;
					s_i32SpeakingReleaseCount[trackId] = 0;
					if (s_i32SpeakingConfirmCount[trackId] >= SPEAKING_SMOOTHING_FRAMES) {
						s_abSpeaking[trackId] = true;
					}
				} else if (s_abSpeaking[trackId]) {
					s_i32SpeakingDurationCount[trackId]++;
					if (signalBelowOff) {
						s_i32SpeakingReleaseCount[trackId]++;
						if (s_i32SpeakingReleaseCount[trackId] >= SPEAKING_RELEASE_FRAMES &&
							s_i32SpeakingDurationCount[trackId] >= SPEAKING_MIN_DURATION_FRAMES) {
							s_abSpeaking[trackId] = false;
						}
					} else {
						s_i32SpeakingReleaseCount[trackId] = 0;
					}
					s_i32SpeakingConfirmCount[trackId] = 0;
				} else {
					s_i32SpeakingReleaseCount[trackId] = 0;
					s_i32SpeakingConfirmCount[trackId] = 0;
					s_i32SpeakingDurationCount[trackId] = 0;
				}
				if (!s_abSpeaking[trackId]) {
					s_i32SpeakingDurationCount[trackId] = 0;
				}
				/* Map trackId -> face index for display */
				infFramebuf->isSpeaking[i] = s_abSpeaking[trackId];
				StoreLipState(s_afSmoothedRelX, s_afSmoothedRelY, smoothedMAR, trackId, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
			} else {
				/* Not a detection frame - still need to map trackId to face for display */
				infFramebuf->isSpeaking[i] = s_abSpeaking[trackId];
			}
		} else if (trackId < MAX_TRACKED_FACES) {
			s_asPrevLipState[trackId].valid = 0;
		}

		//Draw lip landmarks (relative coords converted to absolute)
		if(infFramebuf->results_KP.size() >= 468)
		{
			if(profiler){
				u64StartCycle = pmu_get_systick_Count();
			}
			DrawLipLandmark(s_afSmoothedRelX, s_afSmoothedRelY, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h, &infFramebuf->frameImage);

			if(profiler){
				u64EndCycle = pmu_get_systick_Count();
				info("draw face landmark cycles %llu \n", (u64EndCycle - u64StartCycle));
			}
		}
	}

	if(profiler){
		u64StartCycle = pmu_get_systick_Count();
	}

	DrawDetectFace(infFramebuf->results_FD, infFramebuf->isSpeaking, &infFramebuf->frameImage);

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("draw face region cycles %llu \n", (u64EndCycle - u64StartCycle));
	}
}

static int32_t PrepareModelToHyperRAM(void)
{
#define MODEL_FILE "0:\\face_landmark.tflite"
#define EACH_READ_SIZE 512
	
    TCHAR sd_path[] = { '0', ':', 0 };    /* SD drive started from 0 */	
    f_chdrive(sd_path);          /* set default path */

	int32_t i32FileSize;
	int32_t i32FileReadIndex = 0;
	int32_t i32Read;
	
	if(!ModelFileReader_Initialize(MODEL_FILE))
	{
        printf_err("Unable open model %s\n", MODEL_FILE);		
		return -1;
	}
	
	i32FileSize = ModelFileReader_FileSize();
    info("Model file size %i \n", i32FileSize);

	while(i32FileReadIndex < i32FileSize)
	{
		i32Read = ModelFileReader_ReadData((BYTE *)(MODEL_AT_HYPERRAM_ADDR + i32FileReadIndex), EACH_READ_SIZE);
		if(i32Read < 0)
			break;
		i32FileReadIndex += i32Read;
	}
	
	if(i32FileReadIndex < i32FileSize)
	{
        printf_err("Read Model file size is not enough\n");		
		return -2;
	}
	
#if 0
	/* verify */
	i32FileReadIndex = 0;
	ModelFileReader_Rewind();
	BYTE au8TempBuf[EACH_READ_SIZE];
	
	while(i32FileReadIndex < i32FileSize)
	{
		i32Read = ModelFileReader_ReadData((BYTE *)au8TempBuf, EACH_READ_SIZE);
		if(i32Read < 0)
			break;
		
		if(std::memcmp(au8TempBuf, (void *)(MODEL_AT_HYPERRAM_ADDR + i32FileReadIndex), i32Read)!= 0)
		{
			printf_err("verify the model file content is incorrect at %i \n", i32FileReadIndex);		
			return -3;
		}
		i32FileReadIndex += i32Read;
	}
	
#endif	
	ModelFileReader_Finish();
	
	return i32FileSize;
}	

int main()
{
    /* Initialise the UART module to allow printf related functions (if using retarget) */
    BoardInit();

#if defined(__LOAD_MODEL_FROM_SD__)

	/* Copy model file from SD to HyperRAM*/
	int32_t i32ModelSize;

	i32ModelSize = PrepareModelToHyperRAM();
	
	if(i32ModelSize <= 0 )
	{
        printf_err("Failed to prepare model\n");
        return 1;
	}

    /* Model object creation and initialisation. */
    arm::app::FaceLandmarkModel faceLandmarkModel;

    if (!faceLandmarkModel.Init(arm::app::tensorArena_FaceLandmark,
                    sizeof(arm::app::tensorArena_FaceLandmark),
                    (unsigned char *)MODEL_AT_HYPERRAM_ADDR,
                    i32ModelSize))
    {
        printf_err("Failed to initialise model\n");
        return 1;
    }

#else
    /* Model object creation and initialisation. */
    arm::app::FaceLandmarkModel faceLandmarkModel;

    if (!faceLandmarkModel.Init(arm::app::tensorArena_FaceLandmark,
                    sizeof(arm::app::tensorArena_FaceLandmark),
					arm::app::face_landmark::GetModelPointer(),
                    arm::app::face_landmark::GetModelLen()))
    {
        printf_err("Failed to initialise model\n");
        return 1;
    }
	
#endif

    /* Model object creation and initialisation. */
    arm::app::FaceDetectionModel faceDetectionModel;

    if (!faceDetectionModel.Init(arm::app::tensorArena_FaceDetection,
                    sizeof(arm::app::tensorArena_FaceDetection),
					arm::app::face_detection::GetModelPointer(),
                    arm::app::face_detection::GetModelLen()))
    {
        printf_err("Failed to initialise model\n");
        return 1;
    }



    /* Setup cache poicy of tensor arean buffer */
    info("Set tesnor arena cache policy to WTRA \n");
    const std::vector<ARM_MPU_Region_t> mpuConfig =
    {
        {
            // SRAM for tensor arena
            ARM_MPU_RBAR(((unsigned int)arm::app::tensorArena_FaceLandmark),        // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)arm::app::tensorArena_FaceLandmark) + FACE_LANDMARK_ACTIVATION_BUF_SZ - 1),        // Limit
                         eMPU_ATTR_CACHEABLE_WTRA) // Attribute index - Write-Through, Read-allocate
        },
        {
            // SRAM for tensor arena
            ARM_MPU_RBAR(((unsigned int)arm::app::tensorArena_FaceDetection),        // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)arm::app::tensorArena_FaceDetection) + FACE_DETECTION_ACTIVATION_BUF_SZ - 1),        // Limit
                         eMPU_ATTR_CACHEABLE_WTRA) // Attribute index - Write-Through, Read-allocate
        },
        {
            // Image data from CCAP DMA, so must set frame buffer to Non-cache attribute
            ARM_MPU_RBAR(((unsigned int)fb_array),        // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)fb_array) + OMV_FB_SIZE - 1),        // Limit
                         eMPU_ATTR_NON_CACHEABLE) // NonCache
        },
#if (NUM_FRAMEBUF == 2)
        {
            // Image data from CCAP DMA, so must set frame buffer to Non-cache attribute
            ARM_MPU_RBAR(((unsigned int)frame_buf1),        // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)frame_buf1) + OMV_FB_SIZE - 1),        // Limit
                         eMPU_ATTR_NON_CACHEABLE) // NonCache
        },
#endif
    };

